# -*- coding: utf-8 -*-
# writer        Yang
# create_time   2019/11/8 10:48
# file_name     hist.py

import os
from matplotlib import pyplot as plt
import matplotlib
# pyplot并不默认支持中文显示，需要rcParams修改字体实现。'Microsoft YaHei'：微软雅黑字体风格
matplotlib.rcParams['font.family'] = 'Microsoft YaHei'

"""
直方图
对比：
	直方图：适合x坐标数据：连续的数据，数据量大
	柱状图：X坐标，类别，数据量小
"""
TIME = [131, 98, 125, 131, 124, 139, 131, 117, 128, 108, 135, 138, 131, 102, 107, 114, 119, 128, 121, 142, 127, 130, 124, 101, 110, 116, 117, 110, 128, 128, 115, 99, 136, 126, 134, 95, 138, 117, 111, 78, 132, 124, 113, 150, 110, 117, 86, 95, 144, 105, 126, 130, 126, 130, 126, 116, 123, 106, 112, 138, 123, 86, 101, 99, 136, 123, 117, 119, 105, 137, 123, 128, 125, 104, 109, 134, 125, 127, 105, 120, 107, 129, 116, 108, 132, 103, 136, 118, 102, 120, 114, 105, 115, 132, 145, 119, 121, 112, 139, 125, 138, 109, 132, 134, 156, 106, 117, 127, 144, 139, 139, 119, 140, 83, 110, 102, 123, 107, 143, 115, 136, 118, 139, 123, 112, 118, 125, 109, 119, 133, 112, 114, 122, 109, 106, 123, 116, 131, 127, 115, 118, 112, 135, 115, 146, 137, 116, 103, 144, 83, 123, 111, 110, 111, 100, 154, 136, 100, 118, 119, 133, 134, 106, 129, 126, 110, 111, 109, 141, 120, 117, 106, 149, 122, 122, 110, 118, 127, 121, 114, 125, 126, 114, 140, 103, 130, 141, 117, 106, 114, 121, 114, 133, 137, 92, 121, 112, 146, 97, 137, 105, 98, 117, 112, 81, 97, 139, 113, 134, 106, 144, 110, 137, 137, 111, 104, 117, 100, 111, 101, 110, 105, 129, 137, 112, 120, 113, 133, 112, 83, 94, 146, 133, 101, 131, 116, 111, 84, 137, 115, 122, 106, 144, 109, 123, 116, 111, 111, 133, 150]

# 电影时长数据表
def example_one():
    plt.figure(figsize=(20, 8), dpi=100)

    # 设置组距，为了确定组数
    bins = 2

    # 设置组数 == （最大值-最小值）/组距
    group = int((max(TIME) - min(TIME)) / bins)

    # 直方图需要“hist”关键字表示。有两个参数，第一个为数据源，第二个为组数
    plt.hist(TIME, group, color='c')

    # 设置刻度的范围（注意：刻度范围要和组距相同。）
    plt.xticks(list(range(min(TIME), max(TIME)))[::2])

    plt.xlabel('电影时长大小')
    plt.ylabel('电影的数据量')
    plt.title('电影数据表格')

    # 设置网格，gird（默认为True，网线类型，网线清晰度，网线颜色）, axis="y"只显示y轴的网格
    plt.grid(True, linestyle='-.', alpha=0.7, color='r')

    plt.savefig(os.path.join(os.getcwd(), "hist_01.png"))

    plt.show()


if __name__ == "__main__":
    example_one()
